tests/apacheBenchmarks.txt
Apache Benchmark stats


*************
Command1:
*************
ab -c 100 -n 20000 -p "/Users/amb/dev/github/pinz/resources/curl_examples/data/remoteServer/postQuakeTimeExample.json" -T "application/json" http://192.168.1.200:3000/data


**********
Results1:
**********

Benchmarking 192.168.1.200 (be patient)
Completed 2000 requests
Completed 4000 requests
Completed 6000 requests
Completed 8000 requests
Completed 10000 requests
Completed 12000 requests
Completed 14000 requests
Completed 16000 requests
Completed 18000 requests
Completed 20000 requests
Finished 20000 requests


Server Software:        
Server Hostname:        192.168.1.200
Server Port:            3000

Document Path:          /data
Document Length:        192963 bytes

Concurrency Level:      100
Time taken for tests:   3196.254 seconds
Complete requests:      20000
Failed requests:        19115
   (Connect: 0, Receive: 0, Length: 19115, Exceptions: 0)
Write errors:           0
Total transferred:      4365345708 bytes
Total POSTed:           5421084
HTML transferred:       4361965032 bytes
Requests per second:    6.26 [#/sec] (mean)
Time per request:       15981.271 [ms] (mean)
Time per request:       159.813 [ms] (mean, across all concurrent requests)
Transfer rate:          1333.76 [Kbytes/sec] received
                        1.66 kb/s sent
                        1335.42 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1 1074 694.5    997    8123
Processing:   145 14780 12952.3  10826  266442
Waiting:       30 1351 1712.1   1048   58885
Total:        146 15854 13127.4  12005  267130

Percentage of the requests served within a certain time (ms)
  50%  12005
  66%  15603
  75%  19137
  80%  21813
  90%  29885
  95%  39050
  98%  52682
  99%  66291
 100%  267130 (longest request)



************
Command2:
************

ab -c 10 -n 1000 -p "/Users/amb/dev/github/pinz/resources/curl_examples/data/remoteServer/postQuakeTimeExample.json" -T "application/json" http://192.168.1.200:3000/data

**************
Results2:
**************


Benchmarking 192.168.1.200 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        
Server Hostname:        192.168.1.200
Server Port:            3000

Document Path:          /data
Document Length:        245169 bytes

Concurrency Level:      10
Time taken for tests:   122.402 seconds
Complete requests:      1000
Failed requests:        336
   (Connect: 0, Receive: 0, Length: 336, Exceptions: 0)
Write errors:           0
Total transferred:      246349784 bytes
Total POSTed:           271271
HTML transferred:       246180615 bytes
Requests per second:    8.17 [#/sec] (mean)
Time per request:       1224.016 [ms] (mean)
Time per request:       122.402 [ms] (mean, across all concurrent requests)
Transfer rate:          1965.46 [Kbytes/sec] received
                        2.16 kb/s sent
                        1967.63 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        3   83  24.4     82     460
Processing:   819 1137 173.8   1122    3886
Waiting:       64  135  38.8    129     485
Total:        878 1221 174.6   1206    3990

Percentage of the requests served within a certain time (ms)
  50%   1206
  66%   1250
  75%   1287
  80%   1313
  90%   1381
  95%   1460
  98%   1620
  99%   1805
 100%   3990 (longest request)



 ************
 Comand 3 - all localhost resources
 ************

 ab -c 1 -n 1000 -p "/Users/amb/dev/github/pinz/resources/curl_examples/data/remoteServer/postQuakeTimeExample.json" -T "application/json" http://127.0.0.1:3000/data

************
Results 3
*************

Benchmarking 127.0.0.1 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            3000

Document Path:          /data
Document Length:        16265 bytes

Concurrency Level:      1
Time taken for tests:   2.362 seconds
Complete requests:      1000
Failed requests:        0
Write errors:           0
Total transferred:      16433000 bytes
Total POSTed:           267000
HTML transferred:       16265000 bytes
Requests per second:    423.30 [#/sec] (mean)
Time per request:       2.362 [ms] (mean)
Time per request:       2.362 [ms] (mean, across all concurrent requests)
Transfer rate:          6793.01 [Kbytes/sec] received
                        110.37 kb/s sent
                        6903.38 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     2    2   1.0      2      20
Waiting:        2    2   1.0      2      20
Total:          2    2   1.0      2      20

Percentage of the requests served within a certain time (ms)
  50%      2
  66%      2
  75%      2
  80%      2
  90%      3
  95%      3
  98%      4
  99%      5
 100%     20 (longest request)